<PAD>
<UNK>
<EOS>
find
in
the
.
a
first
then
of
one
or
room
bedrooms
kitchen
bathrooms
living
table
dining
chair
hallways
office
picture
familyroom
rooms
an
plant
lamp
laundryroom
mudroom
curtain
tv
familyrooms
entryway
foyer
lobby
mirror
sink
shelf
sofa
lounge
toilet
pillow
staircases
couch
entryways
foyers
lobbies
desk
offices
counter
kitchens
coffee
lounges
box
bench
fireplace
pot
vase
armchair
paper
towel
exercise
trash
stool
closet
painting
can
meetingrooms
conferencerooms
workout
gym
closets
book
recreation
game
machine
balconies
cushion
bowl
refrigerator
faucet
chandelier
bedroom
flower
stove
staircase
fan
shower
shelves
balcony
bookshelf
washing
ottoman
nightstand
bed
basin
photo
bottle
dresser
vent
oven
utilityrooms
toolrooms
pillar
end
wash
rack
stand
statue
soap
microwave
island
bathtub
dispenser
drawer
fire
chest
clock
wardrobe
spas
saunas
alarm
round
plate
rail
tissue
bathroom
basket
blinds
clothes
footstool
fruit
monitor
railing
rod
bucket
piano
shelving
screen
blanket
dishwasher
speaker
books
sculpture
telephone
flowers
cup
pillows
clutter
switch
thermostat
bar
container
coat
toilets
headboard
printer
garage
food
drawers
range
hood
garages
computer
toiletry
candle
center
vanity
case
treadmill
tree
radiator
board
valence
swivel
ladder
utilityroom
toolroom
hat
hangers
air
conditioner
appliance
teapot
sheet
guitar
bin
plants
post
bag
heater
holder
potted
toy
curtains
dryer
spa
sauna
art
painter
laundryrooms
mudrooms
display
bottles
head
control
chimney
cupboard
classrooms
maker
handle
sign
phone
scale
tray
candlestick
furniture
pool
hanger
easy
seat
decorative
set
towels
easel
keyboard
bedpost
pedestal
laundry
hamper
fence
robe
panel
bidet
trinket
pan
ball
weight
suitcase
boxes
doll
hallway
extinguisher
knickknack
umbrella
globe
car
dish
bookcase
ornament
urn
candelabra
commode
fridge
power
breaker
bust
dinner
place
setting
lampshade
utensils
shoes
tap
dress
smoke
locker
plush
equipment
water
cooler
candles
brush
purse
shampoo
decor
bulletin
fencing
exit
electric
wire
casing
weights
showcase
figure
shrubbery
massage
glass
hose
cloth
mask
wooden
detector
landing
placemat
library
footrest
barricade
bike
storage
ridge
whiteboard
